RhinoInside.Revit API Documentation
GeometryEncoder.ToMesh Method (Mesh)
 Converts the specified Rhino.Geometry.Mesh to an equivalent of Autodesk.Revit.DB.Mesh.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Mesh ToMesh(
	this Rhino.Geometry.Mesh mesh
)
@staticmethod
def ToMesh(
	mesh: Rhino.Geometry.Mesh
) -> Autodesk.Revit.DB.Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
Rhino mesh to convert.
Return Value
Type: Autodesk.Revit.DB.Mesh
Revit mesh that is equivalent to the provided Rhino mesh.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Mesh. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToMesh(Mesh) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Mesh revitMesh = rhinoMesh.ToMesh();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_mesh: DB.Mesh = rhino_mesh.ToMesh()
 Using ToMesh(Mesh) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Mesh revitMesh = GeometryEncoder.ToMesh(rhinoMesh);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_mesh: DB.Mesh = ge.ToMesh(rhino_mesh)
See Also
Reference
GeometryEncoder Class
ToMesh Overload
RhinoInside.Revit.Convert.Geometry Namespace